sorosaulong-ux/gd32-test-project/Library/gd32a7xx_trigsel.h
/*!
    \file    gd32a7xx_trigsel.h
    \brief   definitions for the TRIGSEL

    \version 2025-08-06, V0.1.0, firmware for GD32A7xx
*/

/*
    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#ifndef GD32A7XX_TRIGSEL_H
#define GD32A7XX_TRIGSEL_H

#include "gd32a7xx.h"

/* TRIGSEL definitions */
#define TRIGSEL                                     TRIGSEL_BASE                          /*!< TRIGSEL base address */

/* register definitions */
#define TRIGSEL_EXTOUT_0                            REG32((TRIGSEL) + 0x00000000U)        /*!< TRIGSEL trigger selection for EXTOUT register 0 */
#define TRIGSEL_EXTOUT_1                            REG32((TRIGSEL) + 0x00000004U)        /*!< TRIGSEL trigger selection for EXTOUT register 1 */
#define TRIGSEL_EXTOUT_2                            REG32((TRIGSEL) + 0x00000008U)        /*!< TRIGSEL trigger selection for EXTOUT register 2 */
#define TRIGSEL_EXTOUT_3                            REG32((TRIGSEL) + 0x0000000CU)        /*!< TRIGSEL trigger selection for EXTOUT register 3 */
#define TRIGSEL_EXTOUT_4                            REG32((TRIGSEL) + 0x00000010U)        /*!< TRIGSEL trigger selection for EXTOUT register 4 */
#define TRIGSEL_EXTOUT_5                            REG32((TRIGSEL) + 0x00000014U)        /*!< TRIGSEL trigger selection for EXTOUT register 5 */
#define TRIGSEL_EXTOUT_6                            REG32((TRIGSEL) + 0x00000018U)        /*!< TRIGSEL trigger selection for EXTOUT register 6 */
#define TRIGSEL_EXTOUT_7                            REG32((TRIGSEL) + 0x0000001CU)        /*!< TRIGSEL trigger selection for EXTOUT register 7 */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define TRIGSEL_IOC_0                               REG32((TRIGSEL) + 0x00000020U)        /*!< TRIGSEL trigger selection for IOC register 0 */
#define TRIGSEL_IOC_1                               REG32((TRIGSEL) + 0x00000024U)        /*!< TRIGSEL trigger selection for IOC register 1 */
#define TRIGSEL_IOC_2                               REG32((TRIGSEL) + 0x00000028U)        /*!< TRIGSEL trigger selection for IOC register 2 */
#define TRIGSEL_IOC_3                               REG32((TRIGSEL) + 0x0000002CU)        /*!< TRIGSEL trigger selection for IOC register 3 */
#define TRIGSEL_IOC_4                               REG32((TRIGSEL) + 0x00000030U)        /*!< TRIGSEL trigger selection for IOC register 4 */
#define TRIGSEL_IOC_5                               REG32((TRIGSEL) + 0x00000034U)        /*!< TRIGSEL trigger selection for IOC register 5 */
#define TRIGSEL_IOC_6                               REG32((TRIGSEL) + 0x00000038U)        /*!< TRIGSEL trigger selection for IOC register 6 */
#define TRIGSEL_IOC_7                               REG32((TRIGSEL) + 0x0000003CU)        /*!< TRIGSEL trigger selection for IOC register 7 */
#define TRIGSEL_CAN_0                               REG32((TRIGSEL) + 0x00000040U)        /*!< TRIGSEL trigger selection for CAN register 0 */
#define TRIGSEL_CAN_1                               REG32((TRIGSEL) + 0x00000044U)        /*!< TRIGSEL trigger selection for CAN register 1 */
#define TRIGSEL_CAN_2                               REG32((TRIGSEL) + 0x00000048U)        /*!< TRIGSEL trigger selection for CAN register 2 */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define TRIGSEL_TIMER0ITI0                          REG32((TRIGSEL) + 0x0000005CU)        /*!< TRIGSEL trigger selection for TIMER0_ITI0 register */
#define TRIGSEL_TIMER1ITI0                          REG32((TRIGSEL) + 0x00000060U)        /*!< TRIGSEL trigger selection for TIMER1_ITI0 register */
#define TRIGSEL_TIMER2ITI0                          REG32((TRIGSEL) + 0x00000064U)        /*!< TRIGSEL trigger selection for TIMER2_ITI0 register */
#define TRIGSEL_TIMER7ITI0                          REG32((TRIGSEL) + 0x00000068U)        /*!< TRIGSEL trigger selection for TIMER7_ITI0 register */
#define TRIGSEL_TIMER19ITI0                         REG32((TRIGSEL) + 0x0000006CU)        /*!< TRIGSEL trigger selection for TIMER19_ITI0 register */
#define TRIGSEL_TIMER20ITI0                         REG32((TRIGSEL) + 0x00000070U)        /*!< TRIGSEL trigger selection for TIMER20_ITI0 register */
#define TRIGSEL_TIMER60ITI0                         REG32((TRIGSEL) + 0x00000074U)        /*!< TRIGSEL trigger selection for TIMER60_ITI0 register */
#define TRIGSEL_TIMER61ITI0                         REG32((TRIGSEL) + 0x00000078U)        /*!< TRIGSEL trigger selection for TIMER61_ITI0 register */
#define TRIGSEL_TIMER62ITI0                         REG32((TRIGSEL) + 0x0000007CU)        /*!< TRIGSEL trigger selection for TIMER62_ITI0 register */
#define TRIGSEL_TIMER63ITI0                         REG32((TRIGSEL) + 0x00000080U)        /*!< TRIGSEL trigger selection for TIMER63_ITI0 register */
#define TRIGSEL_TIMER0BRKIN_0                       REG32((TRIGSEL) + 0x00000084U)        /*!< TRIGSEL trigger selection for TIMER0_BRKIN register 0 */
#define TRIGSEL_TIMER0BRKIN_1                       REG32((TRIGSEL) + 0x00000084U)        /*!< TRIGSEL trigger selection for TIMER0_BRKIN register 1 */
#define TRIGSEL_TIMER7BRKIN_0                       REG32((TRIGSEL) + 0x0000008CU)        /*!< TRIGSEL trigger selection for TIMER7_BRKIN register 0 */
#define TRIGSEL_TIMER7BRKIN_1                       REG32((TRIGSEL) + 0x00000090U)        /*!< TRIGSEL trigger selection for TIMER7_BRKIN register 1 */
#define TRIGSEL_TIMER19BRKIN_0                      REG32((TRIGSEL) + 0x00000094U)        /*!< TRIGSEL trigger selection for TIMER19_BRKIN register 0 */
#define TRIGSEL_TIMER19BRKIN_1                      REG32((TRIGSEL) + 0x00000098U)        /*!< TRIGSEL trigger selection for TIMER19_BRKIN register 1 */
#define TRIGSEL_TIMER20BRKIN_0                      REG32((TRIGSEL) + 0x0000009CU)        /*!< TRIGSEL trigger selection for TIMER20_BRKIN register 0 */
#define TRIGSEL_TIMER20BRKIN_1                      REG32((TRIGSEL) + 0x000000A0U)        /*!< TRIGSEL trigger selection for TIMER20_BRKIN register 1 */
#define TRIGSEL_TIMER60BRKIN_0                      REG32((TRIGSEL) + 0x000000A4U)        /*!< TRIGSEL trigger selection for TIMER60_BRKIN register 0 */
#define TRIGSEL_TIMER60BRKIN_1                      REG32((TRIGSEL) + 0x000000A8U)        /*!< TRIGSEL trigger selection for TIMER60_BRKIN register 1 */
#define TRIGSEL_TIMER61BRKIN_0                      REG32((TRIGSEL) + 0x000000ACU)        /*!< TRIGSEL trigger selection for TIMER61_BRKIN register 0 */
#define TRIGSEL_TIMER61BRKIN_1                      REG32((TRIGSEL) + 0x000000B0U)        /*!< TRIGSEL trigger selection for TIMER61_BRKIN register 1 */
#define TRIGSEL_TIMER62BRKIN_0                      REG32((TRIGSEL) + 0x000000B4U)        /*!< TRIGSEL trigger selection for TIMER62_BRKIN register 0 */
#define TRIGSEL_TIMER62BRKIN_1                      REG32((TRIGSEL) + 0x000000B8U)        /*!< TRIGSEL trigger selection for TIMER62_BRKIN register 1 */
#define TRIGSEL_TIMER63BRKIN_0                      REG32((TRIGSEL) + 0x000000BCU)        /*!< TRIGSEL trigger selection for TIMER62_BRKIN register 0 */
#define TRIGSEL_TIMER63BRKIN_1                      REG32((TRIGSEL) + 0x000000C0U)        /*!< TRIGSEL trigger selection for TIMER62_BRKIN register 1 */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define TRIGSEL_MFCOM_0                             REG32((TRIGSEL) + 0x000000C4U)        /*!< TRIGSEL trigger selection for MFCOM register 0 */
#define TRIGSEL_MFCOM_1                             REG32((TRIGSEL) + 0x000000C8U)        /*!< TRIGSEL trigger selection for MFCOM register 1 */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define TRIGSEL_CM7                                 REG32((TRIGSEL) + 0x000000CCU)        /*!< TRIGSEL trigger selection for CM7 register */
#define TRIGSEL_DAC                                 REG32((TRIGSEL) + 0x000000D0U)        /*!< TRIGSEL trigger selection for DAC register */
#define TRIGSEL_ADC0ROUTRG                          REG32((TRIGSEL) + 0x000000D4U)        /*!< TRIGSEL trigger selection for ADC0_ROUTRG register */
#define TRIGSEL_ADC0INSTRG_0                        REG32((TRIGSEL) + 0x000000D8U)        /*!< TRIGSEL trigger selection for ADC0_INSTRG register 0 */
#define TRIGSEL_ADC0INSTRG_1                        REG32((TRIGSEL) + 0x000000DCU)        /*!< TRIGSEL trigger selection for ADC0_INSTRG register 1 */
#define TRIGSEL_ADC1ROUTRG                          REG32((TRIGSEL) + 0x000000E0U)        /*!< TRIGSEL trigger selection for ADC1_ROUTRG register */
#define TRIGSEL_ADC1INSTRG_0                        REG32((TRIGSEL) + 0x000000E4U)        /*!< TRIGSEL trigger selection for ADC1_INSTRG register 0 */
#define TRIGSEL_ADC1INSTRG_1                        REG32((TRIGSEL) + 0x000000E8U)        /*!< TRIGSEL trigger selection for ADC1_INSTRG register 1 */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define TRIGSEL_ADC2ROUTRG                          REG32((TRIGSEL) + 0x000000ECU)        /*!< TRIGSEL trigger selection for ADC2_ROUTRG register */
#define TRIGSEL_ADC2INSTRG_0                        REG32((TRIGSEL) + 0x000000F0U)        /*!< TRIGSEL trigger selection for ADC2_INSTRG register 0 */
#define TRIGSEL_ADC2INSTRG_1                        REG32((TRIGSEL) + 0x000000F4U)        /*!< TRIGSEL trigger selection for ADC2_INSTRG register 1 */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define TRIGSEL_SPI_0                               REG32((TRIGSEL) + 0x000000F8U)        /*!< TRIGSEL trigger selection for SPI register 0 */
#define TRIGSEL_SPI_1                               REG32((TRIGSEL) + 0x000000FCU)        /*!< TRIGSEL trigger selection for SPI register 1 */
#define TRIGSEL_SPI_2                               REG32((TRIGSEL) + 0x00000100U)        /*!< TRIGSEL trigger selection for SPI register 2 */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define TRIGSEL_SPI_3                               REG32((TRIGSEL) + 0x00000104U)        /*!< TRIGSEL trigger selection for SPI register 3 */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define TRIGSEL_TIMERETI                            REG32((TRIGSEL) + 0x00000108U)        /*!< TRIGSEL trigger selection for TIMETR_ETI register */
#if defined(GD32A711X_A712X)
#define TRIGSEL_LINFLEXD_0                          REG32((TRIGSEL) + 0x0000010CU)        /*!< TRIGSEL trigger selection for TRIGSEL_LINFLEXD register 0 */
#define TRIGSEL_LINFLEXD_1                          REG32((TRIGSEL) + 0x00000110U)        /*!< TRIGSEL trigger selection for TRIGSEL_LINFLEXD register 1 */
#define TRIGSEL_LINFLEXD_2                          REG32((TRIGSEL) + 0x00000114U)        /*!< TRIGSEL trigger selection for TRIGSEL_LINFLEXD register 2 */
#endif /* defined(GD32A711X_A712X) */

