sorosaulong-ux/gd32-test-project/Library/gd32a7xx_trigsel.h
/* bits definitions */
#define TRIGSEL_TARGET_INSEL0                       BITS(0, 7)                            /*!< trigger input source selection for output0 */
#define TRIGSEL_TARGET_INSEL1                       BITS(8, 15)                           /*!< trigger input source selection for output1 */
#define TRIGSEL_TARGET_INSEL2                       BITS(16, 23)                          /*!< trigger input source selection for output2 */
#define TRIGSEL_TARGET_LK                           BIT(31)                               /*!< TRIGSEL register lock */

/* constants definitions */
/* trigger source definitions */
typedef enum
{
    TRIGSEL_INPUT_0                                 = ((uint8_t)0x00U),                   /*!< trigger input source 0 */
    TRIGSEL_INPUT_1                                 = ((uint8_t)0x01U),                   /*!< trigger input source 1 */
    TRIGSEL_INPUT_TRIGSEL_IN0                       = ((uint8_t)0x02U),                   /*!< trigger input source TRIGSEL_IN0 pin */
    TRIGSEL_INPUT_TRIGSEL_IN1                       = ((uint8_t)0x03U),                   /*!< trigger input source TRIGSEL_IN1 pin */
    TRIGSEL_INPUT_TRIGSEL_IN2                       = ((uint8_t)0x04U),                   /*!< trigger input source TRIGSEL_IN2 pin */
    TRIGSEL_INPUT_TRIGSEL_IN3                       = ((uint8_t)0x05U),                   /*!< trigger input source TRIGSEL_IN3 pin */
    TRIGSEL_INPUT_TRIGSEL_IN4                       = ((uint8_t)0x06U),                   /*!< trigger input source TRIGSEL_IN4 pin */
    TRIGSEL_INPUT_TRIGSEL_IN5                       = ((uint8_t)0x07U),                   /*!< trigger input source TRIGSEL_IN5 pin */
    TRIGSEL_INPUT_TRIGSEL_IN6                       = ((uint8_t)0x08U),                   /*!< trigger input source TRIGSEL_IN6 pin */
    TRIGSEL_INPUT_TRIGSEL_IN7                       = ((uint8_t)0x09U),                   /*!< trigger input source TRIGSEL_IN7 pin */
    TRIGSEL_INPUT_TRIGSEL_IN8                       = ((uint8_t)0x0AU),                   /*!< trigger input source TRIGSEL_IN8 pin */
    TRIGSEL_INPUT_TRIGSEL_IN9                       = ((uint8_t)0x0BU),                   /*!< trigger input source TRIGSEL_IN9 pin */
    TRIGSEL_INPUT_TRIGSEL_IN10                      = ((uint8_t)0x0CU),                   /*!< trigger input source TRIGSEL_IN10 pin */
    TRIGSEL_INPUT_TRIGSEL_IN11                      = ((uint8_t)0x0DU),                   /*!< trigger input source TRIGSEL_IN11 pin */
    TRIGSEL_INPUT_TRIGSEL_IN12                      = ((uint8_t)0x0EU),                   /*!< trigger input source TRIGSEL_IN12 pin */
    TRIGSEL_INPUT_TRIGSEL_IN13                      = ((uint8_t)0x0FU),                   /*!< trigger input source TRIGSEL_IN13 pin */
    TRIGSEL_INPUT_TRIGSEL_IN14                      = ((uint8_t)0x10U),                   /*!< trigger input source TRIGSEL_IN14 pin */
    TRIGSEL_INPUT_TRIGSEL_IN15                      = ((uint8_t)0x11U),                   /*!< trigger input source TRIGSEL_IN15 pin */
    TRIGSEL_INPUT_TIMER0_TRGO0                      = ((uint8_t)0x12U),                   /*!< trigger input source TIMER0 TRGO0 output */
    TRIGSEL_INPUT_TIMER0_CH0                        = ((uint8_t)0x13U),                   /*!< trigger input source TIMER0 CH0 output */
    TRIGSEL_INPUT_TIMER0_CH1                        = ((uint8_t)0x14U),                   /*!< trigger input source TIMER0 CH1 output */
    TRIGSEL_INPUT_TIMER0_CH2                        = ((uint8_t)0x15U),                   /*!< trigger input source TIMER0 CH2 output */
    TRIGSEL_INPUT_TIMER0_CH3                        = ((uint8_t)0x16U),                   /*!< trigger input source TIMER0 CH3 output */
    TRIGSEL_INPUT_TIMER0_MCH0                       = ((uint8_t)0x17U),                   /*!< trigger input source TIMER0 MCH0 output */
    TRIGSEL_INPUT_TIMER0_MCH1                       = ((uint8_t)0x18U),                   /*!< trigger input source TIMER0 MCH1 output */
    TRIGSEL_INPUT_TIMER0_MCH2                       = ((uint8_t)0x19U),                   /*!< trigger input source TIMER0 MCH2 output */
    TRIGSEL_INPUT_TIMER0_MCH3                       = ((uint8_t)0x1AU),                   /*!< trigger input source TIMER0 MCH3 output */
    TRIGSEL_INPUT_TIMER7_TRGO0                      = ((uint8_t)0x1BU),                   /*!< trigger input source TIMER7 TRGO0 output */
    TRIGSEL_INPUT_TIMER7_CH0                        = ((uint8_t)0x1CU),                   /*!< trigger input source TIMER7 CH0 output */
    TRIGSEL_INPUT_TIMER7_CH1                        = ((uint8_t)0x1DU),                   /*!< trigger input source TIMER7 CH1 output */
    TRIGSEL_INPUT_TIMER7_CH2                        = ((uint8_t)0x1EU),                   /*!< trigger input source TIMER7 CH2 output */
    TRIGSEL_INPUT_TIMER7_CH3                        = ((uint8_t)0x1FU),                   /*!< trigger input source TIMER7 CH3 output */
    TRIGSEL_INPUT_TIMER7_MCH0                       = ((uint8_t)0x20U),                   /*!< trigger input source TIMER7 MCH0 output */
    TRIGSEL_INPUT_TIMER7_MCH1                       = ((uint8_t)0x21U),                   /*!< trigger input source TIMER7 MCH1 output */
    TRIGSEL_INPUT_TIMER7_MCH2                       = ((uint8_t)0x22U),                   /*!< trigger input source TIMER7 MCH2 output */
    TRIGSEL_INPUT_TIMER7_MCH3                       = ((uint8_t)0x23U),                   /*!< trigger input source TIMER7 MCH3 output */
    TRIGSEL_INPUT_TIMER19_TRGO0                     = ((uint8_t)0x24U),                   /*!< trigger input source TIMER19 TRGO0 output */
    TRIGSEL_INPUT_TIMER19_CH0                       = ((uint8_t)0x25U),                   /*!< trigger input source TIMER19 CH0 output */
    TRIGSEL_INPUT_TIMER19_CH1                       = ((uint8_t)0x26U),                   /*!< trigger input source TIMER19 CH1 output */
    TRIGSEL_INPUT_TIMER19_CH2                       = ((uint8_t)0x27U),                   /*!< trigger input source TIMER19 CH2 output */
    TRIGSEL_INPUT_TIMER19_CH3                       = ((uint8_t)0x28U),                   /*!< trigger input source TIMER19 CH3 output */
    TRIGSEL_INPUT_TIMER19_MCH0                      = ((uint8_t)0x29U),                   /*!< trigger input source TIMER19 MCH0 output */
    TRIGSEL_INPUT_TIMER19_MCH1                      = ((uint8_t)0x2AU),                   /*!< trigger input source TIMER19 MCH1 output */
    TRIGSEL_INPUT_TIMER19_MCH2                      = ((uint8_t)0x2BU),                   /*!< trigger input source TIMER19 MCH2 output */
    TRIGSEL_INPUT_TIMER19_MCH3                      = ((uint8_t)0x2CU),                   /*!< trigger input source TIMER19 MCH3 output */
    TRIGSEL_INPUT_TIMER20_TRGO0                     = ((uint8_t)0x2DU),                   /*!< trigger input source TIMER20 TRGO0 output */
    TRIGSEL_INPUT_TIMER20_CH0                       = ((uint8_t)0x2EU),                   /*!< trigger input source TIMER20 CH0 output */
    TRIGSEL_INPUT_TIMER20_CH1                       = ((uint8_t)0x2FU),                   /*!< trigger input source TIMER20 CH1 output */
    TRIGSEL_INPUT_TIMER20_CH2                       = ((uint8_t)0x30U),                   /*!< trigger input source TIMER20 CH2 output */
    TRIGSEL_INPUT_TIMER20_CH3                       = ((uint8_t)0x31U),                   /*!< trigger input source TIMER20 CH3 output */
    TRIGSEL_INPUT_TIMER20_MCH0                      = ((uint8_t)0x32U),                   /*!< trigger input source TIMER20 MCH0 output */
    TRIGSEL_INPUT_TIMER20_MCH1                      = ((uint8_t)0x33U),                   /*!< trigger input source TIMER20 MCH1 output */
    TRIGSEL_INPUT_TIMER20_MCH2                      = ((uint8_t)0x34U),                   /*!< trigger input source TIMER20 MCH2 output */
    TRIGSEL_INPUT_TIMER20_MCH3                      = ((uint8_t)0x35U),                   /*!< trigger input source TIMER20 MCH3 output */
    TRIGSEL_INPUT_TIMER60_TRGO0                     = ((uint8_t)0x36U),                   /*!< trigger input source TIMER60 TRGO0 output */
    TRIGSEL_INPUT_TIMER60_CH0                       = ((uint8_t)0x37U),                   /*!< trigger input source TIMER60 CH0 output */
    TRIGSEL_INPUT_TIMER60_CH1                       = ((uint8_t)0x38U),                   /*!< trigger input source TIMER60 CH1 output */
    TRIGSEL_INPUT_TIMER60_CH2                       = ((uint8_t)0x39U),                   /*!< trigger input source TIMER60 CH2 output */
    TRIGSEL_INPUT_TIMER60_CH3                       = ((uint8_t)0x3AU),                   /*!< trigger input source TIMER60 CH3 output */
    TRIGSEL_INPUT_TIMER60_MCH0                      = ((uint8_t)0x3BU),                   /*!< trigger input source TIMER60 MCH0 output */
    TRIGSEL_INPUT_TIMER60_MCH1                      = ((uint8_t)0x3CU),                   /*!< trigger input source TIMER60 MCH1 output */
    TRIGSEL_INPUT_TIMER60_MCH2                      = ((uint8_t)0x3DU),                   /*!< trigger input source TIMER60 MCH2 output */
    TRIGSEL_INPUT_TIMER60_MCH3                      = ((uint8_t)0x3EU),                   /*!< trigger input source TIMER60 MCH3 output */
    TRIGSEL_INPUT_TIMER61_TRGO0                     = ((uint8_t)0x3FU),                   /*!< trigger input source TIMER61 TRGO0 output */
    TRIGSEL_INPUT_TIMER61_CH0                       = ((uint8_t)0x40U),                   /*!< trigger input source TIMER61 CH0 output */
    TRIGSEL_INPUT_TIMER61_CH1                       = ((uint8_t)0x41U),                   /*!< trigger input source TIMER61 CH1 output */
    TRIGSEL_INPUT_TIMER61_CH2                       = ((uint8_t)0x42U),                   /*!< trigger input source TIMER61 CH2 output */
    TRIGSEL_INPUT_TIMER61_CH3                       = ((uint8_t)0x43U),                   /*!< trigger input source TIMER61 CH3 output */
    TRIGSEL_INPUT_TIMER61_MCH0                      = ((uint8_t)0x44U),                   /*!< trigger input source TIMER61 MCH0 output */
    TRIGSEL_INPUT_TIMER61_MCH1                      = ((uint8_t)0x45U),                   /*!< trigger input source TIMER61 MCH1 output */
    TRIGSEL_INPUT_TIMER61_MCH2                      = ((uint8_t)0x46U),                   /*!< trigger input source TIMER61 MCH2 output */
    TRIGSEL_INPUT_TIMER61_MCH3                      = ((uint8_t)0x47U),                   /*!< trigger input source TIMER61 MCH3 output */
    TRIGSEL_INPUT_TIMER62_TRGO0                     = ((uint8_t)0x48U),                   /*!< trigger input source TIMER62 TRGO0 output */
    TRIGSEL_INPUT_TIMER62_CH0                       = ((uint8_t)0x49U),                   /*!< trigger input source TIMER62 CH0 output */
    TRIGSEL_INPUT_TIMER62_CH1                       = ((uint8_t)0x4AU),                   /*!< trigger input source TIMER62 CH1 output */
    TRIGSEL_INPUT_TIMER62_CH2                       = ((uint8_t)0x4BU),                   /*!< trigger input source TIMER62 CH2 output */
    TRIGSEL_INPUT_TIMER62_CH3                       = ((uint8_t)0x4CU),                   /*!< trigger input source TIMER62 CH3 output */
    TRIGSEL_INPUT_TIMER62_MCH0                      = ((uint8_t)0x4DU),                   /*!< trigger input source TIMER62 MCH0 output */
    TRIGSEL_INPUT_TIMER62_MCH1                      = ((uint8_t)0x4EU),                   /*!< trigger input source TIMER62 MCH1 output */
    TRIGSEL_INPUT_TIMER62_MCH2                      = ((uint8_t)0x4FU),                   /*!< trigger input source TIMER62 MCH2 output */
    TRIGSEL_INPUT_TIMER62_MCH3                      = ((uint8_t)0x50U),                   /*!< trigger input source TIMER62 MCH3 output */
    TRIGSEL_INPUT_TIMER63_TRGO0                     = ((uint8_t)0x51U),                   /*!< trigger input source TIMER63 TRGO0 output */
    TRIGSEL_INPUT_TIMER63_CH0                       = ((uint8_t)0x52U),                   /*!< trigger input source TIMER63 CH0 output */
    TRIGSEL_INPUT_TIMER63_CH1                       = ((uint8_t)0x53U),                   /*!< trigger input source TIMER63 CH1 output */
    TRIGSEL_INPUT_TIMER63_CH2                       = ((uint8_t)0x54U),                   /*!< trigger input source TIMER63 CH2 output */
    TRIGSEL_INPUT_TIMER63_CH3                       = ((uint8_t)0x55U),                   /*!< trigger input source TIMER63 CH3 output */
    TRIGSEL_INPUT_TIMER63_MCH0                      = ((uint8_t)0x56U),                   /*!< trigger input source TIMER63 MCH0 output */
    TRIGSEL_INPUT_TIMER63_MCH1                      = ((uint8_t)0x57U),                   /*!< trigger input source TIMER63 MCH1 output */
    TRIGSEL_INPUT_TIMER63_MCH2                      = ((uint8_t)0x58U),                   /*!< trigger input source TIMER63 MCH2 output */
    TRIGSEL_INPUT_TIMER63_MCH3                      = ((uint8_t)0x59U),                   /*!< trigger input source TIMER63 MCH3 output */
    TRIGSEL_INPUT_TIMER1_TRGO0                      = ((uint8_t)0x5AU),                   /*!< trigger input source TIMER1 TRGO0 output */
    TRIGSEL_INPUT_TIMER1_CH0                        = ((uint8_t)0x5BU),                   /*!< trigger input source TIMER1 CH0 output */
    TRIGSEL_INPUT_TIMER1_CH1                        = ((uint8_t)0x5CU),                   /*!< trigger input source TIMER1 CH1 output */
    TRIGSEL_INPUT_TIMER1_CH2                        = ((uint8_t)0x5DU),                   /*!< trigger input source TIMER1 CH2 output */
    TRIGSEL_INPUT_TIMER1_CH3                        = ((uint8_t)0x5EU),                   /*!< trigger input source TIMER1 CH3 output */
    TRIGSEL_INPUT_TIMER2_TRGO0                      = ((uint8_t)0x5FU),                   /*!< trigger input source TIMER2 TRGO0 output */
    TRIGSEL_INPUT_TIMER2_CH0                        = ((uint8_t)0x60U),                   /*!< trigger input source TIMER2 CH0 output */
    TRIGSEL_INPUT_TIMER2_CH1                        = ((uint8_t)0x61U),                   /*!< trigger input source TIMER2 CH1 output */
    TRIGSEL_INPUT_TIMER2_CH2                        = ((uint8_t)0x62U),                   /*!< trigger input source TIMER2 CH2 output */
    TRIGSEL_INPUT_TIMER2_CH3                        = ((uint8_t)0x63U),                   /*!< trigger input source TIMER2 CH3 output */
    TRIGSEL_INPUT_TIMER5_TRGO0                      = ((uint8_t)0x64U),                   /*!< trigger input source TIMER5 TRGO0 output */
    TRIGSEL_INPUT_TIMER5_TRGO1                      = ((uint8_t)0x65U),                   /*!< trigger input source TIMER5 TRGO1 output */
    TRIGSEL_INPUT_TIMER5_TRGO2                      = ((uint8_t)0x66U),                   /*!< trigger input source TIMER5 TRGO2 output */
    TRIGSEL_INPUT_TIMER5_TRGO3                      = ((uint8_t)0x67U),                   /*!< trigger input source TIMER5 TRGO3 output */
    TRIGSEL_INPUT_TIMER6_TRGO0                      = ((uint8_t)0x69U),                   /*!< trigger input source TIMER6 TRGO0 output */
    TRIGSEL_INPUT_TIMER6_TRGO1                      = ((uint8_t)0x6AU),                   /*!< trigger input source TIMER6 TRGO1 output */
    TRIGSEL_INPUT_TIMER6_TRGO2                      = ((uint8_t)0x6BU),                   /*!< trigger input source TIMER6 TRGO2 output */
    TRIGSEL_INPUT_TIMER6_TRGO3                      = ((uint8_t)0x6CU),                   /*!< trigger input source TIMER6 TRGO3 output */
    TRIGSEL_INPUT_CMP0_OUT                          = ((uint8_t)0x6EU),                   /*!< trigger input source CMP0 output */
    TRIGSEL_INPUT_CMP1_OUT                          = ((uint8_t)0x6FU),                   /*!< trigger input source CMP1 output */
    TRIGSEL_INPUT_BKP_TAMPER                        = ((uint8_t)0x70U),                   /*!< trigger input source BKP tamper interrupt flag */
    TRIGSEL_INPUT_RTC_ALARM                         = ((uint8_t)0x71U),                   /*!< trigger input source RTC alarm output */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
    TRIGSEL_INPUT_MFCOM_TIMER0_OUT                  = ((uint8_t)0x72U),                   /*!< trigger input source MFCOM TIMER0 output */
    TRIGSEL_INPUT_MFCOM_TIMER1_OUT                  = ((uint8_t)0x73U),                   /*!< trigger input source MFCOM TIMER1 output */
    TRIGSEL_INPUT_MFCOM_TIMER2_OUT                  = ((uint8_t)0x74U),                   /*!< trigger input source MFCOM TIMER2 output */
    TRIGSEL_INPUT_MFCOM_TIMER3_OUT                  = ((uint8_t)0x75U),                   /*!< trigger input source MFCOM TIMER3 output */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
    TRIGSEL_INPUT_CM7_0_TXEV                        = ((uint8_t)0x76U),                   /*!< trigger input source CM7_0_TXEV */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
    TRIGSEL_INPUT_CM7_1_TXEV                        = ((uint8_t)0x77U),                   /*!< trigger input source CM7_1_TXEV */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
    TRIGSEL_INPUT_CK_OUT0                           = ((uint8_t)0x78U),                   /*!< trigger input source CK_OUT0 */
    TRIGSEL_INPUT_TIMER_ETI0                        = ((uint8_t)0x79U),                   /*!< trigger input source TIMER_ETI0 pin */
    TRIGSEL_INPUT_TIMER_ETI1                        = ((uint8_t)0x7AU),                   /*!< trigger input source TIMER_ETI1 pin */
    TRIGSEL_INPUT_TIMER_ETI2                        = ((uint8_t)0x7BU),                   /*!< trigger input source TIMER_ETI2 pin */
    TRIGSEL_INPUT_CK_OUT1                           = ((uint8_t)0x7CU),                   /*!< trigger input source CK_OUT1 */
    TRIGSEL_INPUT_DAC0_EOC                          = ((uint8_t)0xA3U),                   /*!< trigger input source DAC0_eoc */
    TRIGSEL_INPUT_DAC1_EOC                          = ((uint8_t)0xA4U),                   /*!< trigger input source DAC1_eoc */
    TRIGSEL_INPUT_ADC0_EORC                         = ((uint8_t)0xA5U),                   /*!< trigger input source end of ADC0 routine sequence conversion */
    TRIGSEL_INPUT_ADC1_EORC                         = ((uint8_t)0xA6U),                   /*!< trigger input source end of ADC1 routine sequence conversion */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
    TRIGSEL_INPUT_ADC2_EORC                         = ((uint8_t)0xA7U),                   /*!< trigger input source end of ADC2 routine sequence conversion */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
    TRIGSEL_INPUT_ADC0_ECH                          = ((uint8_t)0xA8U),                   /*!< trigger input source end of ADC0 routine/inserted sequence channel conversion */
    TRIGSEL_INPUT_ADC1_ECH                          = ((uint8_t)0xA9U),                   /*!< trigger input source end of ADC1 routine/inserted sequence channel conversion */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
    TRIGSEL_INPUT_ADC2_ECH                          = ((uint8_t)0xAAU),                   /*!< trigger input source end of ADC2 routine/inserted sequence channel conversion */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
    TRIGSEL_INPUT_ADC0_WD0_OUT                      = ((uint8_t)0xABU),                   /*!< trigger input source ADC0 analog watchdog0 output */
    TRIGSEL_INPUT_ADC0_WD1_OUT                      = ((uint8_t)0xACU),                   /*!< trigger input source ADC0 analog watchdog1 output */
    TRIGSEL_INPUT_ADC0_WD2_OUT                      = ((uint8_t)0xADU),                   /*!< trigger input source ADC0 analog watchdog2 output */
    TRIGSEL_INPUT_ADC0_WD3_OUT                      = ((uint8_t)0xAEU),                   /*!< trigger input source ADC0 analog watchdog3 output */
    TRIGSEL_INPUT_ADC1_WD0_OUT                      = ((uint8_t)0xAFU),                   /*!< trigger input source ADC1 analog watchdog0 output */
    TRIGSEL_INPUT_ADC1_WD1_OUT                      = ((uint8_t)0xB0U),                   /*!< trigger input source ADC1 analog watchdog1 output */
    TRIGSEL_INPUT_ADC1_WD2_OUT                      = ((uint8_t)0xB1U),                   /*!< trigger input source ADC1 analog watchdog2 output */
    TRIGSEL_INPUT_ADC1_WD3_OUT                      = ((uint8_t)0xB2U),                   /*!< trigger input source ADC1 analog watchdog3 output */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
    TRIGSEL_INPUT_ADC2_WD0_OUT                      = ((uint8_t)0xB3U),                   /*!< trigger input source ADC2 analog watchdog0 output */
    TRIGSEL_INPUT_ADC2_WD1_OUT                      = ((uint8_t)0xB4U),                   /*!< trigger input source ADC2 analog watchdog1 output */
    TRIGSEL_INPUT_ADC2_WD2_OUT                      = ((uint8_t)0xB5U),                   /*!< trigger input source ADC2 analog watchdog2 output */
    TRIGSEL_INPUT_ADC2_WD3_OUT                      = ((uint8_t)0xB6U),                   /*!< trigger input source ADC2 analog watchdog3 output */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
    TRIGSEL_INPUT_ADC0_EOI0C                        = ((uint8_t)0xB7U),                   /*!< trigger input source end of ADC0 inserted sequence 0 conversion */
    TRIGSEL_INPUT_ADC0_EOI1C                        = ((uint8_t)0xB8U),                   /*!< trigger input source end of ADC0 inserted sequence 1 conversion */
    TRIGSEL_INPUT_ADC0_EOI2C                        = ((uint8_t)0xB9U),                   /*!< trigger input source end of ADC0 inserted sequence 2 conversion */
    TRIGSEL_INPUT_ADC0_EOI3C                        = ((uint8_t)0xBAU),                   /*!< trigger input source end of ADC0 inserted sequence 3 conversion */
    TRIGSEL_INPUT_ADC0_EOI4C                        = ((uint8_t)0xBBU),                   /*!< trigger input source end of ADC0 inserted sequence 4 conversion */
    TRIGSEL_INPUT_ADC0_EOI5C                        = ((uint8_t)0xBCU),                   /*!< trigger input source end of ADC0 inserted sequence 5 conversion */
    TRIGSEL_INPUT_ADC1_EOI0C                        = ((uint8_t)0xBDU),                   /*!< trigger input source end of ADC1 inserted sequence 0 conversion */
    TRIGSEL_INPUT_ADC1_EOI1C                        = ((uint8_t)0xBEU),                   /*!< trigger input source end of ADC1 inserted sequence 1 conversion */
    TRIGSEL_INPUT_ADC1_EOI2C                        = ((uint8_t)0xBFU),                   /*!< trigger input source end of ADC1 inserted sequence 2 conversion */
    TRIGSEL_INPUT_ADC1_EOI3C                        = ((uint8_t)0xC0U),                   /*!< trigger input source end of ADC1 inserted sequence 3 conversion */
    TRIGSEL_INPUT_ADC1_EOI4C                        = ((uint8_t)0xC1U),                   /*!< trigger input source end of ADC1 inserted sequence 4 conversion */
    TRIGSEL_INPUT_ADC1_EOI5C                        = ((uint8_t)0xC2U),                   /*!< trigger input source end of ADC1 inserted sequence 5 conversion */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
    TRIGSEL_INPUT_ADC2_EOI0C                        = ((uint8_t)0xC3U),                   /*!< trigger input source end of ADC2 inserted sequence 0 conversion */
    TRIGSEL_INPUT_ADC2_EOI1C                        = ((uint8_t)0xC4U),                   /*!< trigger input source end of ADC2 inserted sequence 1 conversion */
    TRIGSEL_INPUT_ADC2_EOI2C                        = ((uint8_t)0xC5U),                   /*!< trigger input source end of ADC2 inserted sequence 2 conversion */
    TRIGSEL_INPUT_ADC2_EOI3C                        = ((uint8_t)0xC6U),                   /*!< trigger input source end of ADC2 inserted sequence 3 conversion */
