sorosaulong-ux/gd32-test-project/Library/gd32a7xx_trigsel.h
    TRIGSEL_INPUT_ADC2_EOI4C                        = ((uint8_t)0xC7U),                   /*!< trigger input source end of ADC2 inserted sequence 4 conversion */
    TRIGSEL_INPUT_ADC2_EOI5C                        = ((uint8_t)0xC8U),                   /*!< trigger input source end of ADC2 inserted sequence 5 conversion */
    TRIGSEL_INPUT_TIMER0_TRGO0_IOC                  = ((uint8_t)0xC9U),                   /*!< trigger input source TIMER0 TRGO0 signal to IOC */
    TRIGSEL_INPUT_TIMER7_TRGO0_IOC                  = ((uint8_t)0xCAU),                   /*!< trigger input source TIMER7 TRGO0 signal to IOC */
    TRIGSEL_INPUT_TIMER19_TRGO0_IOC                 = ((uint8_t)0xCBU),                   /*!< trigger input source TIMER19 TRGO0 signal to IOC */
    TRIGSEL_INPUT_TIMER20_TRGO0_IOC                 = ((uint8_t)0xCCU),                   /*!< trigger input source TIMER20 TRGO0 signal to IOC */
    TRIGSEL_INPUT_TIMER60_TRGO0_IOC                 = ((uint8_t)0xCDU),                   /*!< trigger input source TIMER60 TRGO0 signal to IOC */
    TRIGSEL_INPUT_TIMER61_TRGO0_IOC                 = ((uint8_t)0xCEU),                   /*!< trigger input source TIMER61 TRGO0 signal to IOC */
    TRIGSEL_INPUT_TIMER62_TRGO0_IOC                 = ((uint8_t)0xCFU),                   /*!< trigger input source TIMER62 TRGO0 signal to IOC */
    TRIGSEL_INPUT_TIMER63_TRGO0_IOC                 = ((uint8_t)0xD0U),                   /*!< trigger input source TIMER63 TRGO0 signal to IOC */
    TRIGSEL_INPUT_TIMER1_TRGO0_IOC                  = ((uint8_t)0xD1U),                   /*!< trigger input source TIMER1 TRGO0 signal to IOC */
    TRIGSEL_INPUT_TIMER2_TRGO0_IOC                  = ((uint8_t)0xD2U),                   /*!< trigger input source TIMER2 TRGO0 signal to IOC */
    TRIGSEL_INPUT_TIMER5_TRGO0_IOC                  = ((uint8_t)0xD3U),                   /*!< trigger input source TIMER5 TRGO0 signal to IOC */
    TRIGSEL_INPUT_TIMER5_TRGO1_IOC                  = ((uint8_t)0xD4U),                   /*!< trigger input source TIMER5 TRGO0 signal to IOC */
    TRIGSEL_INPUT_TIMER5_TRGO2_IOC                  = ((uint8_t)0xD5U),                   /*!< trigger input source TIMER5 TRGO0 signal to IOC */
    TRIGSEL_INPUT_TIMER5_TRGO3_IOC                  = ((uint8_t)0xD6U),                   /*!< trigger input source TIMER5 TRGO0 signal to IOC */
    TRIGSEL_INPUT_TIMER6_TRGO0_IOC                  = ((uint8_t)0xD7U),                   /*!< trigger input source TIMER6 TRGO0 signal to IOC */
    TRIGSEL_INPUT_TIMER6_TRGO1_IOC                  = ((uint8_t)0xD8U),                   /*!< trigger input source TIMER6 TRGO0 signal to IOC */
    TRIGSEL_INPUT_TIMER6_TRGO2_IOC                  = ((uint8_t)0xD9U),                   /*!< trigger input source TIMER6 TRGO0 signal to IOC */
    TRIGSEL_INPUT_TIMER6_TRGO3_IOC                  = ((uint8_t)0xDAU),                   /*!< trigger input source TIMER6 TRGO0 signal to IOC */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
}trigsel_source_enum;

/* target peripheral definitions */
typedef enum
{
    TRIGSEL_OUTPUT_TRIGSEL_OUT0                     = ((uint8_t)0x00U),                   /*!< output target peripheral TRIGSEL_OUT0 pin */
    TRIGSEL_OUTPUT_TRIGSEL_OUT1                     = ((uint8_t)0x01U),                   /*!< output target peripheral TRIGSEL_OUT1 pin */
    TRIGSEL_OUTPUT_TRIGSEL_OUT2                     = ((uint8_t)0x04U),                   /*!< output target peripheral TRIGSEL_OUT2 pin */
    TRIGSEL_OUTPUT_TRIGSEL_OUT3                     = ((uint8_t)0x05U),                   /*!< output target peripheral TRIGSEL_OUT3 pin */
    TRIGSEL_OUTPUT_TRIGSEL_OUT4                     = ((uint8_t)0x08U),                   /*!< output target peripheral TRIGSEL_OUT4 pin */
    TRIGSEL_OUTPUT_TRIGSEL_OUT5                     = ((uint8_t)0x09U),                   /*!< output target peripheral TRIGSEL_OUT5 pin */
    TRIGSEL_OUTPUT_TRIGSEL_OUT6                     = ((uint8_t)0x0CU),                   /*!< output target peripheral TRIGSEL_OUT6 pin */
    TRIGSEL_OUTPUT_TRIGSEL_OUT7                     = ((uint8_t)0x0DU),                   /*!< output target peripheral TRIGSEL_OUT7 pin */
    TRIGSEL_OUTPUT_TRIGSEL_OUT8                     = ((uint8_t)0x10U),                   /*!< output target peripheral TRIGSEL_OUT8 pin */
    TRIGSEL_OUTPUT_TRIGSEL_OUT9                     = ((uint8_t)0x11U),                   /*!< output target peripheral TRIGSEL_OUT9 pin */
    TRIGSEL_OUTPUT_TRIGSEL_OUT10                    = ((uint8_t)0x14U),                   /*!< output target peripheral TRIGSEL_OUT10 pin */
    TRIGSEL_OUTPUT_TRIGSEL_OUT11                    = ((uint8_t)0x15U),                   /*!< output target peripheral TRIGSEL_OUT11 pin */
    TRIGSEL_OUTPUT_TRIGSEL_OUT12                    = ((uint8_t)0x18U),                   /*!< output target peripheral TRIGSEL_OUT12 pin */
    TRIGSEL_OUTPUT_TRIGSEL_OUT13                    = ((uint8_t)0x19U),                   /*!< output target peripheral TRIGSEL_OUT13 pin */
    TRIGSEL_OUTPUT_TRIGSEL_OUT14                    = ((uint8_t)0x1CU),                   /*!< output target peripheral TRIGSEL_OUT14 pin */
    TRIGSEL_OUTPUT_TRIGSEL_OUT15                    = ((uint8_t)0x1DU),                   /*!< output target peripheral TRIGSEL_OUT15 pin */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
    TRIGSEL_OUTPUT_IOC_MONITOR0                     = ((uint8_t)0x20U),                   /*!< output target peripheral IOC monitor0 signal */
    TRIGSEL_OUTPUT_IOC_MONITOR1                     = ((uint8_t)0x21U),                   /*!< output target peripheral IOC monitor1 signal */
    TRIGSEL_OUTPUT_IOC_MONITOR2                     = ((uint8_t)0x24U),                   /*!< output target peripheral IOC monitor2 signal */
    TRIGSEL_OUTPUT_IOC_MONITOR3                     = ((uint8_t)0x25U),                   /*!< output target peripheral IOC monitor3 signal */
    TRIGSEL_OUTPUT_IOC_MONITOR4                     = ((uint8_t)0x28U),                   /*!< output target peripheral IOC monitor4 signal */
    TRIGSEL_OUTPUT_IOC_MONITOR5                     = ((uint8_t)0x29U),                   /*!< output target peripheral IOC monitor5 signal */
    TRIGSEL_OUTPUT_IOC_MONITOR6                     = ((uint8_t)0x2CU),                   /*!< output target peripheral IOC monitor6 signal */
    TRIGSEL_OUTPUT_IOC_MONITOR7                     = ((uint8_t)0x2DU),                   /*!< output target peripheral IOC monitor7 signal */
    TRIGSEL_OUTPUT_IOC_REFERENCE0                   = ((uint8_t)0x30U),                   /*!< output target peripheral IOC reference0 signal */
    TRIGSEL_OUTPUT_IOC_REFERENCE1                   = ((uint8_t)0x31U),                   /*!< output target peripheral IOC reference1 signal */
    TRIGSEL_OUTPUT_IOC_REFERENCE2                   = ((uint8_t)0x34U),                   /*!< output target peripheral IOC reference2 signal */
    TRIGSEL_OUTPUT_IOC_REFERENCE3                   = ((uint8_t)0x35U),                   /*!< output target peripheral IOC reference3 signal */
    TRIGSEL_OUTPUT_IOC_REFERENCE4                   = ((uint8_t)0x38U),                   /*!< output target peripheral IOC reference4 signal */
    TRIGSEL_OUTPUT_IOC_REFERENCE5                   = ((uint8_t)0x39U),                   /*!< output target peripheral IOC reference5 signal */
    TRIGSEL_OUTPUT_IOC_REFERENCE6                   = ((uint8_t)0x3CU),                   /*!< output target peripheral IOC reference6 signal */
    TRIGSEL_OUTPUT_IOC_REFERENCE7                   = ((uint8_t)0x3DU),                   /*!< output target peripheral IOC reference7 signal */
    TRIGSEL_OUTPUT_CAN0_EX_TIME_TICK                = ((uint8_t)0x40U),                   /*!< output target peripheral CAN0_EX_TIME_TICK */
    TRIGSEL_OUTPUT_CAN1_EX_TIME_TICK                = ((uint8_t)0x41U),                   /*!< output target peripheral CAN1_EX_TIME_TICK */
    TRIGSEL_OUTPUT_CAN2_EX_TIME_TICK                = ((uint8_t)0x42U),                   /*!< output target peripheral CAN2_EX_TIME_TICK */
    TRIGSEL_OUTPUT_CAN3_EX_TIME_TICK                = ((uint8_t)0x44U),                   /*!< output target peripheral CAN3_EX_TIME_TICK */
    TRIGSEL_OUTPUT_CAN4_EX_TIME_TICK                = ((uint8_t)0x45U),                   /*!< output target peripheral CAN4_EX_TIME_TICK */
    TRIGSEL_OUTPUT_CAN5_EX_TIME_TICK                = ((uint8_t)0x46U),                   /*!< output target peripheral CAN5_EX_TIME_TICK */
    TRIGSEL_OUTPUT_CAN6_EX_TIME_TICK                = ((uint8_t)0x48U),                   /*!< output target peripheral CAN6_EX_TIME_TICK */
    TRIGSEL_OUTPUT_CAN7_EX_TIME_TICK                = ((uint8_t)0x49U),                   /*!< output target peripheral CAN7_EX_TIME_TICK */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
    TRIGSEL_OUTPUT_TIMER0_ITI0                      = ((uint8_t)0x5CU),                   /*!< output target peripheral TIMER0_ITI0 */
    TRIGSEL_OUTPUT_TIMER1_ITI0                      = ((uint8_t)0x60U),                   /*!< output target peripheral TIMER1_ITI0 */
    TRIGSEL_OUTPUT_TIMER2_ITI0                      = ((uint8_t)0x64U),                   /*!< output target peripheral TIMER2_ITI0 */
    TRIGSEL_OUTPUT_TIMER7_ITI0                      = ((uint8_t)0x68U),                   /*!< output target peripheral TIMER7_ITI0 */
    TRIGSEL_OUTPUT_TIMER19_ITI0                     = ((uint8_t)0x6CU),                   /*!< output target peripheral TIMER19_ITI0 */
    TRIGSEL_OUTPUT_TIMER20_ITI0                     = ((uint8_t)0x70U),                   /*!< output target peripheral TIMER20_ITI0 */
    TRIGSEL_OUTPUT_TIMER60_ITI0                     = ((uint8_t)0x74U),                   /*!< output target peripheral TIMER60_ITI0 */
    TRIGSEL_OUTPUT_TIMER61_ITI0                     = ((uint8_t)0x78U),                   /*!< output target peripheral TIMER61_ITI0 */
    TRIGSEL_OUTPUT_TIMER62_ITI0                     = ((uint8_t)0x7CU),                   /*!< output target peripheral TIMER62_ITI0 */
    TRIGSEL_OUTPUT_TIMER63_ITI0                     = ((uint8_t)0x80U),                   /*!< output target peripheral TIMER63_ITI0 */
    TRIGSEL_OUTPUT_TIMER0_BRKIN0                    = ((uint8_t)0x84U),                   /*!< output target peripheral TIMER0_BRKIN0 */
    TRIGSEL_OUTPUT_TIMER0_BRKIN1                    = ((uint8_t)0x85U),                   /*!< output target peripheral TIMER0_BRKIN1 */
    TRIGSEL_OUTPUT_TIMER0_BRKIN2                    = ((uint8_t)0x88U),                   /*!< output target peripheral TIMER0_BRKIN2 */
    TRIGSEL_OUTPUT_TIMER0_BRKIN3                    = ((uint8_t)0x89U),                   /*!< output target peripheral TIMER0_BRKIN3 */
    TRIGSEL_OUTPUT_TIMER7_BRKIN0                    = ((uint8_t)0x8CU),                   /*!< output target peripheral TIMER7_BRKIN0 */
    TRIGSEL_OUTPUT_TIMER7_BRKIN1                    = ((uint8_t)0x8DU),                   /*!< output target peripheral TIMER7_BRKIN1 */
    TRIGSEL_OUTPUT_TIMER7_BRKIN2                    = ((uint8_t)0x90U),                   /*!< output target peripheral TIMER7_BRKIN2 */
    TRIGSEL_OUTPUT_TIMER7_BRKIN3                    = ((uint8_t)0x91U),                   /*!< output target peripheral TIMER7_BRKIN3 */
    TRIGSEL_OUTPUT_TIMER19_BRKIN0                   = ((uint8_t)0x94U),                   /*!< output target peripheral TIMER19_BRKIN0 */
    TRIGSEL_OUTPUT_TIMER19_BRKIN1                   = ((uint8_t)0x95U),                   /*!< output target peripheral TIMER19_BRKIN1 */
    TRIGSEL_OUTPUT_TIMER19_BRKIN2                   = ((uint8_t)0x98U),                   /*!< output target peripheral TIMER19_BRKIN2 */
    TRIGSEL_OUTPUT_TIMER19_BRKIN3                   = ((uint8_t)0x99U),                   /*!< output target peripheral TIMER19_BRKIN3 */
    TRIGSEL_OUTPUT_TIMER20_BRKIN0                   = ((uint8_t)0x9CU),                   /*!< output target peripheral TIMER20_BRKIN0 */
    TRIGSEL_OUTPUT_TIMER20_BRKIN1                   = ((uint8_t)0x9DU),                   /*!< output target peripheral TIMER20_BRKIN1 */
    TRIGSEL_OUTPUT_TIMER20_BRKIN2                   = ((uint8_t)0xA0U),                   /*!< output target peripheral TIMER20_BRKIN2 */
    TRIGSEL_OUTPUT_TIMER20_BRKIN3                   = ((uint8_t)0xA1U),                   /*!< output target peripheral TIMER20_BRKIN3 */
    TRIGSEL_OUTPUT_TIMER60_BRKIN0                   = ((uint8_t)0xA4U),                   /*!< output target peripheral TIMER60_BRKIN0 */
    TRIGSEL_OUTPUT_TIMER60_BRKIN1                   = ((uint8_t)0xA5U),                   /*!< output target peripheral TIMER60_BRKIN1 */
    TRIGSEL_OUTPUT_TIMER60_BRKIN2                   = ((uint8_t)0xA8U),                   /*!< output target peripheral TIMER60_BRKIN2 */
    TRIGSEL_OUTPUT_TIMER60_BRKIN3                   = ((uint8_t)0xA9U),                   /*!< output target peripheral TIMER60_BRKIN3 */
    TRIGSEL_OUTPUT_TIMER61_BRKIN0                   = ((uint8_t)0xACU),                   /*!< output target peripheral TIMER61_BRKIN0 */
    TRIGSEL_OUTPUT_TIMER61_BRKIN1                   = ((uint8_t)0xADU),                   /*!< output target peripheral TIMER61_BRKIN1 */
    TRIGSEL_OUTPUT_TIMER61_BRKIN2                   = ((uint8_t)0xB0U),                   /*!< output target peripheral TIMER61_BRKIN2 */
    TRIGSEL_OUTPUT_TIMER61_BRKIN3                   = ((uint8_t)0xB1U),                   /*!< output target peripheral TIMER61_BRKIN3 */
    TRIGSEL_OUTPUT_TIMER62_BRKIN0                   = ((uint8_t)0xB4U),                   /*!< output target peripheral TIMER62_BRKIN0 */
    TRIGSEL_OUTPUT_TIMER62_BRKIN1                   = ((uint8_t)0xB5U),                   /*!< output target peripheral TIMER62_BRKIN1 */
    TRIGSEL_OUTPUT_TIMER62_BRKIN2                   = ((uint8_t)0xB8U),                   /*!< output target peripheral TIMER62_BRKIN2 */
    TRIGSEL_OUTPUT_TIMER62_BRKIN3                   = ((uint8_t)0xB9U),                   /*!< output target peripheral TIMER62_BRKIN3 */
    TRIGSEL_OUTPUT_TIMER63_BRKIN0                   = ((uint8_t)0xBCU),                   /*!< output target peripheral TIMER63_BRKIN0 */
    TRIGSEL_OUTPUT_TIMER63_BRKIN1                   = ((uint8_t)0xBDU),                   /*!< output target peripheral TIMER63_BRKIN1 */
    TRIGSEL_OUTPUT_TIMER63_BRKIN2                   = ((uint8_t)0xC0U),                   /*!< output target peripheral TIMER63_BRKIN2 */
    TRIGSEL_OUTPUT_TIMER63_BRKIN3                   = ((uint8_t)0xC1U),                   /*!< output target peripheral TIMER63_BRKIN3 */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
    TRIGSEL_OUTPUT_MFCOM_TRIG0                      = ((uint8_t)0xC4U),                   /*!< output target peripheral MFCOM external trigger 0 */
    TRIGSEL_OUTPUT_MFCOM_TRIG1                      = ((uint8_t)0xC5U),                   /*!< output target peripheral MFCOM external trigger 1 */
    TRIGSEL_OUTPUT_MFCOM_TRIG2                      = ((uint8_t)0xC8U),                   /*!< output target peripheral MFCOM external trigger 2 */
    TRIGSEL_OUTPUT_MFCOM_TRIG3                      = ((uint8_t)0xC9U),                   /*!< output target peripheral MFCOM external trigger 3 */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
    TRIGSEL_OUTPUT_CM7_0_RXEV                       = ((uint8_t)0xCCU),                   /*!< output target peripheral CM7_0_RXEV */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
    TRIGSEL_OUTPUT_CM7_1_RXEV                       = ((uint8_t)0xCDU),                   /*!< output target peripheral CM7_1_RXEV */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
    TRIGSEL_OUTPUT_DAC0_OUT0_EXTRG                  = ((uint8_t)0xD0U),                   /*!< output target peripheral DAC0_OUT0 external trigger */
    TRIGSEL_OUTPUT_DAC1_OUT0_EXTRG                  = ((uint8_t)0xD1U),                   /*!< output target peripheral DAC1_OUT0 external trigger */
    TRIGSEL_OUTPUT_ADC0_ROUTRG                      = ((uint8_t)0xD4U),                   /*!< output target peripheral ADC0 routine sequence external trigger */
    TRIGSEL_OUTPUT_ADC0_INS0TRG                     = ((uint8_t)0xD8U),                   /*!< output target peripheral ADC0 inserted sequence 0 external trigger */
    TRIGSEL_OUTPUT_ADC0_INS1TRG                     = ((uint8_t)0xD9U),                   /*!< output target peripheral ADC0 inserted sequence 1 external trigger */
    TRIGSEL_OUTPUT_ADC0_INS2TRG                     = ((uint8_t)0xDAU),                   /*!< output target peripheral ADC0 inserted sequence 2 external trigger */
    TRIGSEL_OUTPUT_ADC0_INS3TRG                     = ((uint8_t)0xDCU),                   /*!< output target peripheral ADC0 inserted sequence 3 external trigger */
    TRIGSEL_OUTPUT_ADC0_INS4TRG                     = ((uint8_t)0xDDU),                   /*!< output target peripheral ADC0 inserted sequence 4 external trigger */
    TRIGSEL_OUTPUT_ADC0_INS5TRG                     = ((uint8_t)0xDEU),                   /*!< output target peripheral ADC0 inserted sequence 5 external trigger */
    TRIGSEL_OUTPUT_ADC1_ROUTRG                      = ((uint8_t)0xE0U),                   /*!< output target peripheral ADC1 routine sequence external trigger  */
    TRIGSEL_OUTPUT_ADC1_INS0TRG                     = ((uint8_t)0xE4U),                   /*!< output target peripheral ADC1 inserted sequence 0 external trigger */
    TRIGSEL_OUTPUT_ADC1_INS1TRG                     = ((uint8_t)0xE5U),                   /*!< output target peripheral ADC1 inserted sequence 1 external trigger */
    TRIGSEL_OUTPUT_ADC1_INS2TRG                     = ((uint8_t)0xE6U),                   /*!< output target peripheral ADC1 inserted sequence 2 external trigger */
    TRIGSEL_OUTPUT_ADC1_INS3TRG                     = ((uint8_t)0xE8U),                   /*!< output target peripheral ADC1 inserted sequence 3 external trigger */
    TRIGSEL_OUTPUT_ADC1_INS4TRG                     = ((uint8_t)0xE9U),                   /*!< output target peripheral ADC1 inserted sequence 4 external trigger */
    TRIGSEL_OUTPUT_ADC1_INS5TRG                     = ((uint8_t)0xEAU),                   /*!< output target peripheral ADC1 inserted sequence 5 external trigger */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
    TRIGSEL_OUTPUT_ADC2_ROUTRG                      = ((uint8_t)0xECU),                   /*!< output target peripheral ADC2 routine sequence external trigger */
    TRIGSEL_OUTPUT_ADC2_INS0TRG                     = ((uint8_t)0xF0U),                   /*!< output target peripheral ADC2 inserted sequence 0 external trigger */
    TRIGSEL_OUTPUT_ADC2_INS1TRG                     = ((uint8_t)0xF1U),                   /*!< output target peripheral ADC2 inserted sequence 1 external trigger */
    TRIGSEL_OUTPUT_ADC2_INS2TRG                     = ((uint8_t)0xF2U),                   /*!< output target peripheral ADC2 inserted sequence 2 external trigger */
    TRIGSEL_OUTPUT_ADC2_INS3TRG                     = ((uint8_t)0xF4U),                   /*!< output target peripheral ADC2 inserted sequence 3 external trigger */
    TRIGSEL_OUTPUT_ADC2_INS4TRG                     = ((uint8_t)0xF5U),                   /*!< output target peripheral ADC2 inserted sequence 4 external trigger */
    TRIGSEL_OUTPUT_ADC2_INS5TRG                     = ((uint8_t)0xF6U),                   /*!< output target peripheral ADC2 inserted sequence 5 external trigger */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
    TRIGSEL_OUTPUT_SPI0_TRIG                        = ((uint8_t)0xF8U),                   /*!< output target peripheral SPI0 trigger */
    TRIGSEL_OUTPUT_SPI1_TRIG                        = ((uint8_t)0xF9U),                   /*!< output target peripheral SPI1 trigger */
    TRIGSEL_OUTPUT_SPI2_TRIG                        = ((uint8_t)0xFCU),                   /*!< output target peripheral SPI2 trigger */
    TRIGSEL_OUTPUT_SPI3_TRIG                        = ((uint8_t)0xFDU),                   /*!< output target peripheral SPI3 trigger */
    TRIGSEL_OUTPUT_SPI4_TRIG                        = ((uint16_t)0x100U),                 /*!< output target peripheral SPI4 trigger */
    TRIGSEL_OUTPUT_SPI5_TRIG                        = ((uint16_t)0x101U),                 /*!< output target peripheral SPI5 trigger */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
    TRIGSEL_OUTPUT_SPI6_TRIG                        = ((uint16_t)0x104U),                 /*!< output target peripheral SPI6 trigger */
    TRIGSEL_OUTPUT_SPI7_TRIG                        = ((uint16_t)0x105U),                 /*!< output target peripheral SPI7 trigger */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
    TRIGSEL_OUTPUT_TIMER_ETI0                       = ((uint16_t)0x108U),                 /*!< output target peripheral TIMER_ETI0 */
    TRIGSEL_OUTPUT_TIMER_ETI1                       = ((uint16_t)0x109U),                 /*!< output target peripheral TIMER_ETI1 */
    TRIGSEL_OUTPUT_TIMER_ETI2                       = ((uint16_t)0x10AU),                 /*!< output target peripheral TIMER_ETI2 */
#if defined(GD32A711X_A712X)
    TRIGSEL_OUTPUT_LINFLEXD0_TRIG                   = ((uint16_t)0x10CU),                 /*!< output target peripheral LINFlexD0 trigger */
    TRIGSEL_OUTPUT_LINFLEXD1_TRIG                   = ((uint16_t)0x10DU),                 /*!< output target peripheral LINFlexD1 trigger */
    TRIGSEL_OUTPUT_LINFLEXD2_TRIG                   = ((uint16_t)0x110U),                 /*!< output target peripheral LINFlexD2 trigger */
    TRIGSEL_OUTPUT_LINFLEXD3_TRIG                   = ((uint16_t)0x111U),                 /*!< output target peripheral LINFlexD3 trigger */
    TRIGSEL_OUTPUT_LINFLEXD4_TRIG                   = ((uint16_t)0x114U),                 /*!< output target peripheral LINFlexD4 trigger */
    TRIGSEL_OUTPUT_LINFLEXD5_TRIG                   = ((uint16_t)0x115U),                 /*!< output target peripheral LINFlexD5 trigger */
#endif /* defined(GD32A711X_A712X) */
}trigsel_periph_enum;

/* function declarations */
/* set the trigger input signal for target peripheral */
void trigsel_init(trigsel_periph_enum target_periph, trigsel_source_enum trigger_source);
/* get the trigger input signal for target peripheral */
trigsel_source_enum trigsel_trigger_source_get(trigsel_periph_enum target_periph);
/* lock the trigger register */
void trigsel_register_lock_set(trigsel_periph_enum target_periph);
/* get the trigger register lock status */
FlagStatus trigsel_register_lock_get(trigsel_periph_enum target_periph);

#endif /* GD32A7XX_TRIGSEL_H */
